<div id="maincontain">
	<br />
	<b>研究領域</b>
	<hr />
		<ul>
		<li>量子通訊安全 </li>
		<li>量子密碼技術 Quantum Cryptography</li>
		<li>網路安全</li>
		<li>資訊安全</li>
		<li>門禁系統</li>
		<li>錯誤控制碼</li> 
	</ul>
	
	
	<br />
	<b>量子通訊安全 ( Quantum Communication Security )</b>
	<hr />
	
	<p>
	量子資訊科學是一門結合量子力學與資訊科學的新興領域，隨著量子相關技術的快速發展，利用量子做為計算與網路通訊媒介之研究也開始受到重視，量子密碼學正為其中一項重要的研究領域。在傳統密碼學中許多安全性植基於解數學難題的協定，因量子電腦的強大運算能力，已被證實為不安全。故如何運用量子物理特性，例如：量測不確定性、不可複製性與糾結性…等，在量子電腦環境下設計出無條件安全之協定為本實驗室主要的研究方向。
	</p>
	<p>
		<b>量子金鑰分配協定 ( Quantum Key Distribution)</b>	
	</p>
	<p>
		由於量子電腦的發展，一些傳統電腦難解的數學難題，已經被證明出可以在多項式時間內被量子電腦破解。傳統密碼學中許多安全性植基於解數學難題之金鑰分配協定，未來可能變得不安全而無法使用。相對的，量子密碼學主要是利用量子的物理特性，例如：量子的不可複製性，量子的量測不確定性原理等，來達到資訊安全的應用。相較於傳統金鑰分配協定，量子金鑰分配協定具有下列兩項優點：1.協定之安全性係植基於量子的物理特性，而非解數學難題上；2.便於檢測金鑰分配過程是否遭人竊聽。<br/>
	</p>
	
	<br />
	
	<p>
		<b>量子直接通訊協定 ( Quantum Direct Communicaton )</b>	
	</p>
	<p>
		量子直接通訊協定為一種量子通訊協定，與量子金鑰分配協定的差別在於，不需要事先分享一把金鑰來進行溝通，可直接藉由量子來傳遞秘密訊息，且同樣基於在無條件安全(Unconditional secure)下，在這幾年，在QSDC上已經有許多相關的研究。
	</p>	
		
	<br />
	
	<p>
		<b>量子模糊傳送協定</b>	
	</p>
	<p>	
		模糊傳送協定(oblivious transfer protocol)是一種兩個人之間交換資訊的方法，也是密碼學中一項重要的基本模型，被應用於許多領域中。在1981年，Rabin率先提出模糊傳送(oblivious transfer)的基本概念，並將其應用於秘密資訊的交換(secret exchange)。在此概念中有兩個角色，傳送方與接收方，傳送方擁有一份秘密訊息，而接收方想要得到這份訊息，於是傳送方將該訊息傳送給接收方，而接收方只有二份之一的機率能夠得到這份秘密訊息。模糊傳送協定的基本概念被出現後，學者們陸續提出各式各樣的糢糊傳送變形，廣泛應用於傳送被確認電子郵件(send certified electronic mail)、電話擲銅板(coin flipping by telephone)、零知識證明(zero knowledge proof)與秘密訊息交換等方面。
	</p>
	<p>
		由於量子密碼學的研究是未來的趨勢，且傳統的模糊傳送協定是植基於一些未被證明安全的難題上，因此如何利用量子力學的物理特性，如量測不確定性、不可複製性等等，來達成傳統模糊傳送協定無法做到的無條件安全(unconditional security)，是一項非常重要的研究。
	</p>
	
	<br />
	
	<p>
		<b>量子秘密分享協定 ( Quantum Secret Sharing )</b>	
	</p>
	<p>	
		量子秘密分享協定全名為Quantum Secret Sharing，顧名思義是三方做分享秘密訊息的協定，三方為老闆與平等地位的兩個員工，當老闆有事要出門遠遊，他必須要有代理人，然而如果只有一位代理人若其對於公司是有企圖的，也就是說他有可能做出對於公司不利的事情，所以這個協定的重點就是，兩位代理人有一方是誠實的，也就是他對公司盡忠職守，不會做出不利的事情，他會盡力阻止另外一個對公司有企圖的人對公司作出不利的事。所以老闆會將秘密訊息分成兩個部份，若要解開整個秘密訊息，就必須要兩個人同時同意解開訊息才可以得出完整的秘密訊息。
	</p>
	
	<p>
		<b>量子對話 (Quantum dialogue)</b>	
	</p>
	<p>
	量子對話為一種祕密交換訊息的方法。該方法能夠將兩個合法使用者的訊息以直接的方式祕密交換。此概念是在2004年由Nguyen率先提出。此方法有兩個角色:傳送方與接收方。兩人各有一份祕密訊息欲傳送給對方。雙方分別將自已欲傳送的祕密訊息，作用於傳送的量子上面。訊息藉由量子一往一返之間地傳送，好像在對話一樣，因此將它命名為”量子對話”。
	</p>
	



</div>